MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX120F032D.atdf
      <value-group caption="Buffer Fill Status bit" name="AD1CON2__BUFS">
         <value caption="ADC is currently filling buffer 0x8-0xF; user should access data in 0x0-0x7" name="" value="0x1" />
         <value caption="ADC is currently filling buffer 0x0-0x7; user should access data in 0x8-0xF" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Scan Select bit" name="AD1CON2__CSCNA">
         <value caption="Scan inputs" name="" value="0x1" />
         <value caption="Do not scan inputs" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Offset Calibration Mode Select bit" name="AD1CON2__OFFCAL">
         <value caption="Enable Offset Calibration mode; Positive and negative inputs of the sample and hold amplifier are connected to VREFL" name="" value="0x1" />
         <value caption="Disable Offset Calibration mode; The inputs to the sample and hold amplifier are controlled by AD1CHS or AD1CSSL" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Reference Configuration bits" name="AD1CON2__VCFG">
         <value caption="VREFH is AVDD and VREFL is AVSS" name="" value="0x0" />
         <value caption="VREFH is Ext VREF + pin and VREFL is AVSS" name="" value="0x1" />
         <value caption="VREFH is AVDD and VREFL is External VREF- pin" name="" value="0x2" />
         <value caption="VREFH is External VREF+ pin and VREFL is External VREF- pin" name="" value="0x3" />
         <value caption="VREFH is AVDD and VREFL is AVSS" name="" value="0x4" />
         <value caption="VREFH is AVDD and VREFL is AVSS" name="" value="0x5" />
         <value caption="VREFH is AVDD and VREFL is AVSS" name="" value="0x6" />
         <value caption="VREFH is AVDD and VREFL is AVSS" name="" value="0x7" />
      </value-group>
      <value-group caption="ADC Conversion Clock Select bits" name="AD1CON3__ADCS">
         <value caption="512*TPB" name="" value="0xff" />
         <value caption="510*TPB" name="" value="0xfe" />
         <value caption="508*TPB" name="" value="0xfd" />
         <value caption="506*TPB" name="" value="0xfc" />
         <value caption="504*TPB" name="" value="0xfb" />
         <value caption="502*TPB" name="" value="0xfa" />
         <value caption="500*TPB" name="" value="0xf9" />
         <value caption="498*TPB" name="" value="0xf8" />
         <value caption="496*TPB" name="" value="0xf7" />
         <value caption="494*TPB" name="" value="0xf6" />
         <value caption="492*TPB" name="" value="0xf5" />
         <value caption="490*TPB" name="" value="0xf4" />
         <value caption="488*TPB" name="" value="0xf3" />
         <value caption="486*TPB" name="" value="0xf2" />
         <value caption="484*TPB" name="" value="0xf1" />
         <value caption="482*TPB" name="" value="0xf0" />
         <value caption="480*TPB" name="" value="0xef" />
         <value caption="478*TPB" name="" value="0xee" />
         <value caption="476*TPB" name="" value="0xed" />
         <value caption="474*TPB" name="" value="0xec" />
         <value caption="472*TPB" name="" value="0xeb" />
         <value caption="470*TPB" name="" value="0xea" />
         <value caption="468*TPB" name="" value="0xe9" />
         <value caption="466*TPB" name="" value="0xe8" />
         <value caption="464*TPB" name="" value="0xe7" />
         <value caption="462*TPB" name="" value="0xe6" />
         <value caption="460*TPB" name="" value="0xe5" />
         <value caption="458*TPB" name="" value="0xe4" />
         <value caption="456*TPB" name="" value="0xe3" />
         <value caption="454*TPB" name="" value="0xe2" />
         <value caption="452*TPB" name="" value="0xe1" />
         <value caption="450*TPB" name="" value="0xe0" />
         <value caption="448*TPB" name="" value="0xdf" />
         <value caption="446*TPB" name="" value="0xde" />
         <value caption="444*TPB" name="" value="0xdd" />
         <value caption="442*TPB" name="" value="0xdc" />
         <value caption="440*TPB" name="" value="0xdb" />
         <value caption="438*TPB" name="" value="0xda" />
         <value caption="436*TPB" name="" value="0xd9" />
         <value caption="434*TPB" name="" value="0xd8" />
         <value caption="432*TPB" name="" value="0xd7" />
         <value caption="430*TPB" name="" value="0xd6" />
         <value caption="428*TPB" name="" value="0xd5" />
         <value caption="426*TPB" name="" value="0xd4" />
         <value caption="424*TPB" name="" value="0xd3" />
         <value caption="422*TPB" name="" value="0xd2" />
         <value caption="420*TPB" name="" value="0xd1" />
         <value caption="418*TPB" name="" value="0xd0" />
         <value caption="416*TPB" name="" value="0xcf" />
         <value caption="414*TPB" name="" value="0xce" />
         <value caption="412*TPB" name="" value="0xcd" />
         <value caption="410*TPB" name="" value="0xcc" />
         <value caption="408*TPB" name="" value="0xcb" />
         <value caption="406*TPB" name="" value="0xca" />
         <value caption="404*TPB" name="" value="0xc9" />
         <value caption="402*TPB" name="" value="0xc8" />
         <value caption="400*TPB" name="" value="0xc7" />
         <value caption="398*TPB" name="" value="0xc6" />
         <value caption="396*TPB" name="" value="0xc5" />
         <value caption="394*TPB" name="" value="0xc4" />
         <value caption="392*TPB" name="" value="0xc3" />
         <value caption="390*TPB" name="" value="0xc2" />
         <value caption="388*TPB" name="" value="0xc1" />
         <value caption="386*TPB" name="" value="0xc0" />
         <value caption="384*TPB" name="" value="0xbf" />
         <value caption="382*TPB" name="" value="0xbe" />
         <value caption="380*TPB" name="" value="0xbd" />
         <value caption="378*TPB" name="" value="0xbc" />
         <value caption="376*TPB" name="" value="0xbb" />
         <value caption="374*TPB" name="" value="0xba" />
         <value caption="372*TPB" name="" value="0xb9" />
         <value caption="370*TPB" name="" value="0xb8" />
         <value caption="368*TPB" name="" value="0xb7" />
         <value caption="366*TPB" name="" value="0xb6" />
         <value caption="364*TPB" name="" value="0xb5" />
         <value caption="362*TPB" name="" value="0xb4" />
         <value caption="360*TPB" name="" value="0xb3" />
         <value caption="358*TPB" name="" value="0xb2" />
         <value caption="356*TPB" name="" value="0xb1" />
         <value caption="354*TPB" name="" value="0xb0" />
         <value caption="352*TPB" name="" value="0xaf" />
         <value caption="350*TPB" name="" value="0xae" />
         <value caption="348*TPB" name="" value="0xad" />
         <value caption="346*TPB" name="" value="0xac" />
         <value caption="344*TPB" name="" value="0xab" />
         <value caption="342*TPB" name="" value="0xaa" />
         <value caption="340*TPB" name="" value="0xa9" />
         <value caption="338*TPB" name="" value="0xa8" />
         <value caption="336*TPB" name="" value="0xa7" />
         <value caption="334*TPB" name="" value="0xa6" />
         <value caption="332*TPB" name="" value="0xa5" />
         <value caption="330*TPB" name="" value="0xa4" />
         <value caption="328*TPB" name="" value="0xa3" />
         <value caption="326*TPB" name="" value="0xa2" />
         <value caption="324*TPB" name="" value="0xa1" />
         <value caption="322*TPB" name="" value="0xa0" />
         <value caption="320*TPB" name="" value="0x9f" />
         <value caption="318*TPB" name="" value="0x9e" />
         <value caption="316*TPB" name="" value="0x9d" />
         <value caption="314*TPB" name="" value="0x9c" />
         <value caption="312*TPB" name="" value="0x9b" />
         <value caption="310*TPB" name="" value="0x9a" />
         <value caption="308*TPB" name="" value="0x99" />
         <value caption="306*TPB" name="" value="0x98" />
         <value caption="304*TPB" name="" value="0x97" />
         <value caption="302*TPB" name="" value="0x96" />
         <value caption="300*TPB" name="" value="0x95" />
         <value caption="298*TPB" name="" value="0x94" />
         <value caption="296*TPB" name="" value="0x93" />
         <value caption="294*TPB" name="" value="0x92" />
         <value caption="292*TPB" name="" value="0x91" />
         <value caption="290*TPB" name="" value="0x90" />
         <value caption="288*TPB" name="" value="0x8f" />
         <value caption="286*TPB" name="" value="0x8e" />
         <value caption="284*TPB" name="" value="0x8d" />
         <value caption="282*TPB" name="" value="0x8c" />
         <value caption="280*TPB" name="" value="0x8b" />
         <value caption="278*TPB" name="" value="0x8a" />
         <value caption="276*TPB" name="" value="0x89" />
         <value caption="274*TPB" name="" value="0x88" />
         <value caption="272*TPB" name="" value="0x87" />
         <value caption="270*TPB" name="" value="0x86" />
         <value caption="268*TPB" name="" value="0x85" />
         <value caption="266*TPB" name="" value="0x84" />
         <value caption="264*TPB" name="" value="0x83" />
         <value caption="262*TPB" name="" value="0x82" />
         <value caption="260*TPB" name="" value="0x81" />
         <value caption="258*TPB" name="" value="0x80" />
         <value caption="256*TPB" name="" value="0x7f" />
         <value caption="254*TPB" name="" value="0x7e" />
         <value caption="252*TPB" name="" value="0x7d" />
         <value caption="250*TPB" name="" value="0x7c" />
         <value caption="248*TPB" name="" value="0x7b" />
         <value caption="246*TPB" name="" value="0x7a" />
         <value caption="244*TPB" name="" value="0x79" />
         <value caption="242*TPB" name="" value="0x78" />
         <value caption="240*TPB" name="" value="0x77" />
         <value caption="238*TPB" name="" value="0x76" />
         <value caption="236*TPB" name="" value="0x75" />
         <value caption="234*TPB" name="" value="0x74" />
         <value caption="232*TPB" name="" value="0x73" />
         <value caption="230*TPB" name="" value="0x72" />
         <value caption="228*TPB" name="" value="0x71" />
         <value caption="226*TPB" name="" value="0x70" />
         <value caption="224*TPB" name="" value="0x6f" />
         <value caption="222*TPB" name="" value="0x6e" />
         <value caption="220*TPB" name="" value="0x6d" />
         <value caption="218*TPB" name="" value="0x6c" />
         <value caption="216*TPB" name="" value="0x6b" />
         <value caption="214*TPB" name="" value="0x6a" />
         <value caption="212*TPB" name="" value="0x69" />
         <value caption="210*TPB" name="" value="0x68" />
         <value caption="208*TPB" name="" value="0x67" />
         <value caption="206*TPB" name="" value="0x66" />
         <value caption="204*TPB" name="" value="0x65" />
         <value caption="202*TPB" name="" value="0x64" />
         <value caption="200*TPB" name="" value="0x63" />
         <value caption="198*TPB" name="" value="0x62" />
         <value caption="196*TPB" name="" value="0x61" />
         <value caption="194*TPB" name="" value="0x60" />
         <value caption="192*TPB" name="" value="0x5f" />
         <value caption="190*TPB" name="" value="0x5e" />
         <value caption="188*TPB" name="" value="0x5d" />
         <value caption="186*TPB" name="" value="0x5c" />
         <value caption="184*TPB" name="" value="0x5b" />
         <value caption="182*TPB" name="" value="0x5a" />
         <value caption="180*TPB" name="" value="0x59" />
         <value caption="178*TPB" name="" value="0x58" />
         <value caption="176*TPB" name="" value="0x57" />
         <value caption="174*TPB" name="" value="0x56" />
         <value caption="172*TPB" name="" value="0x55" />
         <value caption="170*TPB" name="" value="0x54" />
         <value caption="168*TPB" name="" value="0x53" />
         <value caption="166*TPB" name="" value="0x52" />
         <value caption="164*TPB" name="" value="0x51" />
         <value caption="162*TPB" name="" value="0x50" />
         <value caption="160*TPB" name="" value="0x4f" />
         <value caption="158*TPB" name="" value="0x4e" />
         <value caption="156*TPB" name="" value="0x4d" />
         <value caption="154*TPB" name="" value="0x4c" />
         <value caption="152*TPB" name="" value="0x4b" />
         <value caption="150*TPB" name="" value="0x4a" />
         <value caption="148*TPB" name="" value="0x49" />
         <value caption="146*TPB" name="" value="0x48" />
         <value caption="144*TPB" name="" value="0x47" />
         <value caption="142*TPB" name="" value="0x46" />
         <value caption="140*TPB" name="" value="0x45" />
         <value caption="138*TPB" name="" value="0x44" />
         <value caption="136*TPB" name="" value="0x43" />
         <value caption="134*TPB" name="" value="0x42" />
         <value caption="132*TPB" name="" value="0x41" />
         <value caption="130*TPB" name="" value="0x40" />
         <value caption="128*TPB" name="" value="0x3f" />
         <value caption="126*TPB" name="" value="0x3e" />
         <value caption="124*TPB" name="" value="0x3d" />
         <value caption="122*TPB" name="" value="0x3c" />
         <value caption="120*TPB" name="" value="0x3b" />
         <value caption="118*TPB" name="" value="0x3a" />
         <value caption="116*TPB" name="" value="0x39" />
         <value caption="114*TPB" name="" value="0x38" />
         <value caption="112*TPB" name="" value="0x37" />
         <value caption="110*TPB" name="" value="0x36" />
         <value caption="108*TPB" name="" value="0x35" />
         <value caption="106*TPB" name="" value="0x34" />
         <value caption="104*TPB" name="" value="0x33" />
         <value caption="102*TPB" name="" value="0x32" />
         <value caption="100*TPB" name="" value="0x31" />
         <value caption="98*TPB" name="" value="0x30" />
         <value caption="96*TPB" name="" value="0x2f" />
         <value caption="94*TPB" name="" value="0x2e" />
         <value caption="92*TPB" name="" value="0x2d" />
         <value caption="90*TPB" name="" value="0x2c" />
         <value caption="88*TPB" name="" value="0x2b" />
         <value caption="86*TPB" name="" value="0x2a" />
         <value caption="84*TPB" name="" value="0x29" />
         <value caption="82*TPB" name="" value="0x28" />
         <value caption="80*TPB" name="" value="0x27" />
         <value caption="78*TPB" name="" value="0x26" />
         <value caption="76*TPB" name="" value="0x25" />
         <value caption="74*TPB" name="" value="0x24" />
         <value caption="72*TPB" name="" value="0x23" />
         <value caption="70*TPB" name="" value="0x22" />
         <value caption="68*TPB" name="" value="0x21" />
         <value caption="66*TPB" name="" value="0x20" />
         <value caption="64*TPB" name="" value="0x1f" />
         <value caption="62*TPB" name="" value="0x1e" />
         <value caption="60*TPB" name="" value="0x1d" />
         <value caption="58*TPB" name="" value="0x1c" />
         <value caption="56*TPB" name="" value="0x1b" />
         <value caption="54*TPB" name="" value="0x1a" />
         <value caption="52*TPB" name="" value="0x19" />
         <value caption="50*TPB" name="" value="0x18" />
         <value caption="48*TPB" name="" value="0x17" />
         <value caption="46*TPB" name="" value="0x16" />
         <value caption="44*TPB" name="" value="0x15" />
         <value caption="42*TPB" name="" value="0x14" />
         <value caption="40*TPB" name="" value="0x13" />
         <value caption="38*TPB" name="" value="0x12" />
         <value caption="36*TPB" name="" value="0x11" />
         <value caption="34*TPB" name="" value="0x10" />
         <value caption="32*TPB" name="" value="0xf" />
         <value caption="30*TPB" name="" value="0xe" />
         <value caption="28*TPB" name="" value="0xd" />
         <value caption="26*TPB" name="" value="0xc" />
         <value caption="24*TPB" name="" value="0xb" />
         <value caption="22*TPB" name="" value="0xa" />
         <value caption="20*TPB" name="" value="0x9" />
         <value caption="18*TPB" name="" value="0x8" />
         <value caption="16*TPB" name="" value="0x7" />
         <value caption="14*TPB" name="" value="0x6" />
         <value caption="12*TPB" name="" value="0x5" />
         <value caption="10*TPB" name="" value="0x4" />
         <value caption="8*TPB" name="" value="0x3" />
         <value caption="6*TPB" name="" value="0x2" />
         <value caption="4*TPB" name="" value="0x1" />
         <value caption="2*TPB" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Sample Time bits" name="AD1CON3__SAMC">
         <value caption="31 TAD" name="" value="0x1f" />
         <value caption="30 TAD" name="" value="0x1e" />
         <value caption="29 TAD" name="" value="0x1d" />
         <value caption="28 TAD" name="" value="0x1c" />
         <value caption="27 TAD" name="" value="0x1b" />
         <value caption="26 TAD" name="" value="0x1a" />
         <value caption="25 TAD" name="" value="0x19" />
         <value caption="24 TAD" name="" value="0x18" />
         <value caption="23 TAD" name="" value="0x17" />
         <value caption="22 TAD" name="" value="0x16" />
         <value caption="21 TAD" name="" value="0x15" />
         <value caption="20 TAD" name="" value="0x14" />
         <value caption="19 TAD" name="" value="0x13" />
         <value caption="18 TAD" name="" value="0x12" />
         <value caption="17 TAD" name="" value="0x11" />
         <value caption="16 TAD" name="" value="0x10" />
         <value caption="15 TAD" name="" value="0xf" />
         <value caption="14 TAD" name="" value="0xe" />
         <value caption="13 TAD" name="" value="0xd" />
         <value caption="12 TAD" name="" value="0xc" />
         <value caption="11 TAD" name="" value="0xb" />
         <value caption="10 TAD" name="" value="0xa" />
         <value caption="9 TAD" name="" value="0x9" />
         <value caption="8 TAD" name="" value="0x8" />
         <value caption="7 TAD" name="" value="0x7" />
         <value caption="6 TAD" name="" value="0x6" />
         <value caption="5 TAD" name="" value="0x5" />
         <value caption="4 TAD" name="" value="0x4" />
         <value caption="3 TAD" name="" value="0x3" />
         <value caption="2 TAD" name="" value="0x2" />
         <value caption="1 TAD" name="" value="0x1" />
      </value-group>
      <value-group caption="ADC Conversion Clock Source bit" name="AD1CON3__ADRC">
         <value caption="Clock derived from FRC" name="" value="0x1" />
         <value caption="Clock derived from Peripheral Bus Clock (PBCLK)" name="" value="0x0" />
      </value-group>
      <value-group caption="Positive Input Select bits for Sample A" name="AD1CHS__CH0SA">
         <value caption="Channel 0 positive input is Open" name="OPEN" value="0xf" />
         <value caption="Channel 0 positive input is IVREF" name="IVREF" value="0xe" />
         <value caption="Channel 0 positive input is CTMU temperature sensor (CTMUT)" name="CTMUT" value="0xd" />
         <value caption="Channel 0 positive input is AN12" name="AN12" value="0xc" />
         <value caption="Channel 0 positive input is AN11" name="AN11" value="0xb" />
         <value caption="Channel 0 positive input is AN10" name="AN10" value="0xa" />
         <value caption="Channel 0 positive input is AN9" name="AN9" value="0x9" />
         <value caption="Channel 0 positive input is AN8" name="AN8" value="0x8" />
         <value caption="Channel 0 positive input is AN7" name="AN7" value="0x7" />
         <value caption="Channel 0 positive input is AN6" name="AN6" value="0x6" />
         <value caption="Channel 0 positive input is AN5" name="AN5" value="0x5" />
         <value caption="Channel 0 positive input is AN4" name="AN4" value="0x4" />
         <value caption="Channel 0 positive input is AN3" name="AN3" value="0x3" />
         <value caption="Channel 0 positive input is AN2" name="AN2" value="0x2" />
         <value caption="Channel 0 positive input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 positive input is AN0" name="AN0" value="0x0" />
      </value-group>
      <value-group caption="Negative Input Select bit for Sample A" name="AD1CHS__CH0NA">
         <value caption="Channel 0 negative input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 negative input is VREFL" name="VREFL" value="0x0" />
      </value-group>
