MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX120F032D.atdf
      <value-group caption="Channel Source Size bits" name="DCH2SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH3SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH0DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH1DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH2DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH3DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH0SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH1SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH2SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH3SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH0DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH1DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH2DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH3DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH0CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH1CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH2CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH3CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH0CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH1CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH2CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH3CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00774" name="I2C" version="1">
      <register-group name="I2C">
         <register caption="I2C Control Register" name="I2C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C1CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C1CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C1CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C1CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON" />
         </register>
         <register caption="I2C Control Register" name="I2C2CON" offset="0x100" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C2CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C2CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C2CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C2CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C2CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C2CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C2CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C2CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C2CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C2CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C2CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C2CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C2CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C2CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C2CON__ON" />
         </register>
