MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX120F032D.atdf
         <register caption="" name="CNENA" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENA" />
            <bitfield mask="0x00000002" name="CNENA" />
            <bitfield mask="0x00000004" name="CNENA" />
            <bitfield mask="0x00000008" name="CNENA" />
            <bitfield mask="0x00000010" name="CNENA" />
            <bitfield mask="0x00000020" name="CNENA" />
            <bitfield mask="0x00000040" name="CNENA" />
            <bitfield mask="0x00000080" name="CNENA" />
            <bitfield mask="0x00000100" name="CNENA" />
            <bitfield mask="0x00000200" name="CNENA" />
            <bitfield mask="0x00000400" name="CNENA" />
            <bitfield mask="0x00000800" name="CNENA" />
            <bitfield mask="0x00001000" name="CNENA" />
            <bitfield mask="0x00002000" name="CNENA" />
            <bitfield mask="0x00004000" name="CNENA" />
            <bitfield mask="0x00008000" name="CNENA" />
         </register>
         <register caption="" name="CNENB" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENB" />
            <bitfield mask="0x00000002" name="CNENB" />
            <bitfield mask="0x00000004" name="CNENB" />
            <bitfield mask="0x00000008" name="CNENB" />
            <bitfield mask="0x00000010" name="CNENB" />
            <bitfield mask="0x00000020" name="CNENB" />
            <bitfield mask="0x00000040" name="CNENB" />
            <bitfield mask="0x00000080" name="CNENB" />
            <bitfield mask="0x00000100" name="CNENB" />
            <bitfield mask="0x00000200" name="CNENB" />
            <bitfield mask="0x00000400" name="CNENB" />
            <bitfield mask="0x00000800" name="CNENB" />
            <bitfield mask="0x00001000" name="CNENB" />
            <bitfield mask="0x00002000" name="CNENB" />
            <bitfield mask="0x00004000" name="CNENB" />
            <bitfield mask="0x00008000" name="CNENB" />
         </register>
         <register caption="" name="CNENC" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENC" />
            <bitfield mask="0x00000002" name="CNENC" />
            <bitfield mask="0x00000004" name="CNENC" />
            <bitfield mask="0x00000008" name="CNENC" />
            <bitfield mask="0x00000010" name="CNENC" />
            <bitfield mask="0x00000020" name="CNENC" />
            <bitfield mask="0x00000040" name="CNENC" />
            <bitfield mask="0x00000080" name="CNENC" />
            <bitfield mask="0x00000100" name="CNENC" />
            <bitfield mask="0x00000200" name="CNENC" />
            <bitfield mask="0x00000400" name="CNENC" />
            <bitfield mask="0x00000800" name="CNENC" />
            <bitfield mask="0x00001000" name="CNENC" />
            <bitfield mask="0x00002000" name="CNENC" />
            <bitfield mask="0x00004000" name="CNENC" />
            <bitfield mask="0x00008000" name="CNENC" />
         </register>
         <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATA" />
            <bitfield mask="0x00000002" name="CNSTATA" />
            <bitfield mask="0x00000004" name="CNSTATA" />
            <bitfield mask="0x00000008" name="CNSTATA" />
            <bitfield mask="0x00000010" name="CNSTATA" />
            <bitfield mask="0x00000020" name="CNSTATA" />
            <bitfield mask="0x00000040" name="CNSTATA" />
            <bitfield mask="0x00000080" name="CNSTATA" />
            <bitfield mask="0x00000100" name="CNSTATA" />
            <bitfield mask="0x00000200" name="CNSTATA" />
            <bitfield mask="0x00000400" name="CNSTATA" />
            <bitfield mask="0x00000800" name="CNSTATA" />
            <bitfield mask="0x00001000" name="CNSTATA" />
            <bitfield mask="0x00002000" name="CNSTATA" />
            <bitfield mask="0x00004000" name="CNSTATA" />
            <bitfield mask="0x00008000" name="CNSTATA" />
         </register>
         <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB" />
            <bitfield mask="0x00000002" name="CNSTATB" />
            <bitfield mask="0x00000004" name="CNSTATB" />
            <bitfield mask="0x00000008" name="CNSTATB" />
            <bitfield mask="0x00000010" name="CNSTATB" />
            <bitfield mask="0x00000020" name="CNSTATB" />
            <bitfield mask="0x00000040" name="CNSTATB" />
            <bitfield mask="0x00000080" name="CNSTATB" />
            <bitfield mask="0x00000100" name="CNSTATB" />
            <bitfield mask="0x00000200" name="CNSTATB" />
            <bitfield mask="0x00000400" name="CNSTATB" />
            <bitfield mask="0x00000800" name="CNSTATB" />
            <bitfield mask="0x00001000" name="CNSTATB" />
            <bitfield mask="0x00002000" name="CNSTATB" />
            <bitfield mask="0x00004000" name="CNSTATB" />
            <bitfield mask="0x00008000" name="CNSTATB" />
         </register>
         <register caption="" name="CNSTATC" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATC" />
            <bitfield mask="0x00000002" name="CNSTATC" />
            <bitfield mask="0x00000004" name="CNSTATC" />
            <bitfield mask="0x00000008" name="CNSTATC" />
            <bitfield mask="0x00000010" name="CNSTATC" />
            <bitfield mask="0x00000020" name="CNSTATC" />
            <bitfield mask="0x00000040" name="CNSTATC" />
            <bitfield mask="0x00000080" name="CNSTATC" />
            <bitfield mask="0x00000100" name="CNSTATC" />
            <bitfield mask="0x00000200" name="CNSTATC" />
            <bitfield mask="0x00000400" name="CNSTATC" />
            <bitfield mask="0x00000800" name="CNSTATC" />
            <bitfield mask="0x00001000" name="CNSTATC" />
            <bitfield mask="0x00002000" name="CNSTATC" />
            <bitfield mask="0x00004000" name="CNSTATC" />
            <bitfield mask="0x00008000" name="CNSTATC" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01342" name="RCON" version="3">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset (MCLR) Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Voltage Regulator Standby Enable bit" mask="0x00000100" name="VREGS" values="RCON__VREGS" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x10" rw="RW" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST" />
         </register>
      </register-group>
